Австралия/src/Documents/MonthEndClosing/MonthEndClosing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>MonthEndClosing</name>
  <registerRecords>InformationRegister.ForeignExchangeGainsAndLosses</registerRecords>
  <registerRecords>AccumulationRegister.CashInCashRegisters</registerRecords>
  <registerRecords>AccumulationRegister.Sales</registerRecords>
  <registerRecords>AccumulationRegister.LandedCosts</registerRecords>
  <registerRecords>AccumulationRegister.POSSummary</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesSimple</registerRecords>
  <registerRecords>AccumulationRegister.FinancialResult</registerRecords>
  <registerRecords>AccumulationRegister.AdvanceHolders</registerRecords>
  <registerRecords>AccumulationRegister.FundsTransfersBeingProcessed</registerRecords>
  <registerRecords>InformationRegister.WriteOffCostAdjustment</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntries</registerRecords>
  <registerRecords>AccumulationRegister.TaxPayable</registerRecords>
  <registerRecords>AccumulationRegister.AccountsReceivable</registerRecords>
  <registerRecords>AccumulationRegister.Inventory</registerRecords>
  <registerRecords>InformationRegister.DocumentAccountingEntriesStatuses</registerRecords>
  <registerRecords>AccumulationRegister.Payroll</registerRecords>
  <registerRecords>AccumulationRegister.CashAssets</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpenses</registerRecords>
  <registerRecords>AccumulationRegister.AccountsPayable</registerRecords>
  <registerRecords>AccumulationRegister.LoanSettlements</registerRecords>
  <registerRecords>AccumulationRegister.CostOfSubcontractorGoods</registerRecords>
  <registerRecords>InformationRegister.MonthEndErrors</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesCompound</registerRecords>
  <registerRecords>AccumulationRegister.WorkInProgress</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DirectCostCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CostAllocation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ActualCostCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FinancialResultCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExchangeDifferencesCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RetailCostCalculationEarningAccounting</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VerifyTaxInvoices</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VATPayableCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
</mdclass:Document>

Австралия/src/InformationRegisters/AccountingPolicy/AccountingPolicy.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AccountingPolicy</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>RegisteredForVAT</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>PostVATEntriesBySourceDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>PostAdvancePaymentsBySourceDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>IssueAutomaticallyAgainstSales</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>DefaultVATRate</name>
    <type>
      <types>CatalogRef.VATRates</types>
    </type>
  </resources>
  <resources>
    <name>CashMethodOfAccounting</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InventoryValuationMethod</name>
    <type>
      <types>EnumRef.InventoryValuationMethods</types>
    </type>
  </resources>
  <resources>
    <name>UseGoodsReturnFromCustomer</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UseGoodsReturnToSupplier</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>StockTransactionsMethodology</name>
    <type>
      <types>EnumRef.StockTransactionsMethodology</types>
    </type>
  </resources>
  <resources>
    <name>PostExpensesByWorkOrder</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ManufacturingOverheadsAllocationMethod</name>
    <type>
      <types>EnumRef.ManufacturingOverheadsAllocationMethods</types>
    </type>
  </resources>
  <resources>
    <name>InvoiceTotalDue</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>AccountBalance</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>Overdue</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>VATRoundingRule</name>
    <type>
      <types>EnumRef.VATRoundingRules</types>
    </type>
  </resources>
  <resources>
    <name>RegisteredForSalesTax</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UnderOverAllocatedOverheadsSetting</name>
    <type>
      <types>EnumRef.UnderOverAllocatedOverheadsSettings</types>
    </type>
  </resources>
  <resources>
    <name>RegisterDeliveryDateInInvoices</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InventoryDispatchingStrategy</name>
    <type>
      <types>EnumRef.InventoryDispatchingStrategy</types>
    </type>
  </resources>
  <resources>
    <name>AccountingPrice</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </resources>
  <resources>
    <name>UseTemplates</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>RegisterAccountingEntries</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/InformationRegisters/TasksForCostsCalculation/TasksForCostsCalculation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TasksForCostsCalculation</name>
  <dimensions>
    <name>Month</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>TaskNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Enums/InventoryValuationMethods/InventoryValuationMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>InventoryValuationMethods</name>
  <enumValues>
    <name>WeightedAverage</name>
  </enumValues>
  <enumValues>
    <name>FIFO</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Documents/MonthEndClosing/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	Date = EndOfMonth(Date);
	
	FindExistDocumentsInCurrentPeriod(Cancel);
	
	AdditionalProperties.Insert("Posted", Posted);
	
EndProcedure

// Procedure - event handler Posting(). Creates
// a document movement by accumulation registers and accounting register.
//
Procedure Posting(Cancel, PostingMode)
	
	// Initialization of additional properties for document posting.
	DriveServer.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);
	
	// Accounting templates properties initialization.
	AccountingTemplatesPosting.InitializeAccountingTemplatesProperties(Ref, AdditionalProperties, Cancel);
	If AdditionalProperties.ForPosting.AccountingTemplatesPostingUnavailable Then
		Return;
	EndIf;
	
	Documents.MonthEndClosing.InitializeDocumentData(Ref, AdditionalProperties);
	
	DriveServer.ReflectForeignExchangeGainsAndLosses(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectCashAssetsInCashRegisters(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectCashAssets(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectAdvanceHolders(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectAccountsReceivable(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectAccountsPayable(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectPayroll(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectIncomeAndExpenses(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectLoanSettlements(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectFundsTransfersBeingProcessed(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectPOSSummary(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectTaxesSettlements(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectFinancialResult(AdditionalProperties, RegisterRecords, Cancel);
	
	DriveServer.ReflectMonthEndErrors(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectInventory(AdditionalProperties, RegisterRecords, Cancel);
	DriveServer.ReflectSales(AdditionalProperties, RegisterRecords, Cancel);
	// begin Drive.FullVersion
	DriveServer.ReflectWorkInProgress(AdditionalProperties, RegisterRecords, Cancel);
	// end Drive.FullVersion
	
	DriveServer.ReflectCostOfSubcontractorGoods(AdditionalProperties, RegisterRecords, Cancel);
	
	DriveServer.ReflectDocumentAccountingEntriesStatuses(ThisObject, AdditionalProperties, RegisterRecords, Cancel);
	
	// Accounting
	DriveServer.ReflectAccountingJournalEntries(AdditionalProperties, RegisterRecords, Cancel);
	If AdditionalProperties.AccountingPolicy.UseTemplateBasedTypesOfAccounting Then
		DriveServer.ReflectAccountingJournalEntriesCompound(AdditionalProperties, RegisterRecords, Cancel);
		DriveServer.ReflectAccountingJournalEntriesSimple(AdditionalProperties, RegisterRecords, Cancel);
	EndIf;
	
	AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();
	
	AccountingTemplatesPosting.CheckForDuplicateAccountingEntries(Ref, Company, Date, Cancel);
	
	// Subordinate documents
	If Not Cancel Then
		
		AccountingTemplatesPosting.CreateRefreshTransactionDocumentsByMode(
			Ref, DocumentWriteMode.Posting, DeletionMark, Company, Date, AdditionalProperties);
		
	EndIf;
	
EndProcedure

Procedure UndoPosting(Cancel)
	
	InventoryValuationMethod = InformationRegisters.AccountingPolicy.InventoryValuationMethod(Date, Company);
	
	If InventoryValuationMethod = Enums.InventoryValuationMethods.FIFO Then
		
		InformationRegisters.TasksForCostsCalculation.CreateRegisterRecord(
			BegOfMonth(Date),
			Company,
			Ref);
		
	EndIf;
	
	AccountingTemplatesPosting.CheckForDuplicateAccountingEntries(Ref, Company, Date, Cancel);
	
	// Subordinate documents
	If Not Cancel Then
		
		AccountingTemplatesPosting.CreateRefreshTransactionDocumentsByMode(
			Ref, DocumentWriteMode.UndoPosting, DeletionMark, Company, Date, AdditionalProperties);
			
		DriveServer.ReflectDeletionAccountingTransactionDocuments(Ref);
		
	EndIf;
		
EndProcedure

Procedure OnWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	DriveServer.CheckDocumentsReposting(Ref, AdditionalProperties.Posted, Cancel);
	
	If Not Cancel And AdditionalProperties.WriteMode = DocumentWriteMode.Write Then
		
		AccountingTemplatesPosting.CreateRefreshTransactionDocumentsByMode(
			Ref, AdditionalProperties.WriteMode, DeletionMark, Company, Date, AdditionalProperties);
		
	EndIf;
		
EndProcedure

#EndRegion

#Region Private

#Region DocumentsInPeriods

Procedure FindExistDocumentsInCurrentPeriod(Cancel)
	
	Query = New Query(
	"SELECT ALLOWED
	|	MonthEndClosing.Ref AS Ref,
	|	MonthEndClosing.DirectCostCalculation AS DirectCostCalculation,
	|	MonthEndClosing.CostAllocation AS CostAllocation,
	|	MonthEndClosing.ActualCostCalculation AS ActualCostCalculation,
	|	MonthEndClosing.FinancialResultCalculation AS FinancialResultCalculation,
	|	MonthEndClosing.ExchangeDifferencesCalculation AS ExchangeDifferencesCalculation,
	|	MonthEndClosing.RetailCostCalculationEarningAccounting AS RetailCostCalculationEarningAccounting,
	|	MonthEndClosing.VerifyTaxInvoices AS VerifyTaxInvoices,
	|	MonthEndClosing.VATPayableCalculation AS VATPayableCalculation
	|INTO ExistingDocuments
	|FROM
	|	Document.MonthEndClosing AS MonthEndClosing
	|WHERE
	|	MonthEndClosing.Posted
	|	AND ENDOFPERIOD(MonthEndClosing.Date, MONTH) = &Date
	|	AND MonthEndClosing.Company = &Company
	|	AND MonthEndClosing.Ref <> &Ref
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT TOP 1
	|	TRUE
	|FROM
	|	ExistingDocuments AS MonthEndClosing
	|WHERE
	|	(MonthEndClosing.DirectCostCalculation = &DirectCostCalculation
	|				AND MonthEndClosing.DirectCostCalculation
	|			OR MonthEndClosing.CostAllocation = &CostAllocation
	|				AND MonthEndClosing.CostAllocation
	|			OR MonthEndClosing.ActualCostCalculation = &ActualCostCalculation
	|				AND MonthEndClosing.ActualCostCalculation
	|			OR MonthEndClosing.FinancialResultCalculation = &FinancialResultCalculation
	|				AND MonthEndClosing.FinancialResultCalculation
	|			OR MonthEndClosing.ExchangeDifferencesCalculation = &ExchangeDifferencesCalculation
	|				AND MonthEndClosing.ExchangeDifferencesCalculation
	|			OR MonthEndClosing.RetailCostCalculationEarningAccounting = &RetailCostCalculationEarningAccounting
	|				AND MonthEndClosing.RetailCostCalculationEarningAccounting
	|			OR MonthEndClosing.VerifyTaxInvoices = &VerifyTaxInvoices
	|				AND MonthEndClosing.VerifyTaxInvoices
	|			OR MonthEndClosing.VATPayableCalculation = &VATPayableCalculation
	|				AND MonthEndClosing.VATPayableCalculation)");
	
	Query.SetParameter("Date", Date);
	Query.SetParameter("Company", Company);
	Query.SetParameter("Ref", Ref);
	Query.SetParameter("DirectCostCalculation", DirectCostCalculation);
	Query.SetParameter("CostAllocation", CostAllocation);
	Query.SetParameter("ActualCostCalculation", ActualCostCalculation);
	Query.SetParameter("FinancialResultCalculation", FinancialResultCalculation);
	Query.SetParameter("ExchangeDifferencesCalculation", ExchangeDifferencesCalculation);
	Query.SetParameter("RetailCostCalculationEarningAccounting", RetailCostCalculationEarningAccounting);
	Query.SetParameter("VerifyTaxInvoices", VerifyTaxInvoices);
	Query.SetParameter("VATPayableCalculation", VATPayableCalculation);
	
	ExistDocuments = Query.Execute().Select();
	If ExistDocuments.Next() Then
		ExceptionText = StringFunctionsClientServer.SubstituteParametersToString(
			NStr("en = 'The document ""Month-end closing"" in month %1 is already exist in infobase.'; ru = 'Документ ""Закрытие месяца"" за %1 уже создан в базе.';pl = 'Dokument ""Zamknięcie miesiąca"" w miesiącu %1 już istnieje w bazie informacyjnej.';es_ES = 'El documento ""Cierre del mes"" para el mes %1 ya existe en la infobase.';es_CO = 'El documento ""Cierre del mes"" para el mes %1 ya existe en la infobase.';tr = '%1 ayındaki ""Ay sonu kapanışı"" belgesi Infobase''de zaten mevcut.';it = 'Il documento ""Chiusura di fine mese"" nel mese %1 già esiste nel infobase.';de = 'Das Dokument ""Monatsabschluss"" im Monat %1 ist bereits in der Infobase vorhanden.'"),
			Format(Date, "DF='MMMM yyyy'"));
		CommonClientServer.MessageToUser(ExceptionText, , , , Cancel);
	EndIf;
	
EndProcedure

#EndRegion


#EndRegion

#EndIf
